{
  "brandMainText": "SPIDER",

  "brandChangeText": "{order, selectordinal, one {Web Development} two {IT Outsourcing} =3 {Beyond The Web}}",

  "mainHeader": "{order, selectordinal, one {HOME} two {ABOUT} =3 {SERVICE} =4 {TECHNOLOGY}  =5 {CLIENT} =6 {CONTACT} =7 {CAREER}}",

  "test": "I am the {order, selectordinal, one {Frontend Development} two {#nd person} =3 {#rd person}  other {#th person}}",

  "aboutText": "<p>Spider is the leading <strong> web development company</strong> based in Ho Chi Minh City, Vietnam.</p><p>Spider was founded in 2015, focuses on <strong>web development and IT outsourcing services</strong> for small businesses, startups and agencies in the USA, Europe, Australia, Singapore and Vietnam.</p><p>We specialize in building <strong>high-quality websites and applications</strong> using thelatest<strong> web technologies</strong> including<strong> HTML, CSS, JavaScript, PHP and Node.js</strong>.</p><p>We follow W3C standards using the <strong>latest web coding standards and best practices</strong> including W3C compliance, semantic web, web accessibility, search engine optimization and mobile-friendly using responsive web design.</p><p>We believe in offering <strong>the most efficient, reliable and affordable</strong> web development solutions to our clients.</p><p>We guarantee to deliver <strong>clean and high-quality code, maintainable and extensible </strong>for future development.</p><p>We will help you to<strong> grow your business and achieve your goals</strong>.</p><p>We always strive to meet your demands <strong>beyond expectation</strong>.</p>",
  "serviceHeader": "{order, selectordinal, one {Frontend Development} =2 {Backend Development} =3 {Application Development} =4 {JavaScript Full Stack Development} =5{Dedicated Team} =6{Maintenance & Support}}",
  "serviceText": "{order, selectordinal, one {<p>Bootstrap is the most popular HTML, CSS, and JavaScrip framework for developing responsive, mobile first projects on the web.</p><p>React is a declarative, efficient, and flexible JavaScript library for building user interfaces.</p><p>We use Bootstrap for building frontend templates and React for building web applications.</p>} =2{<p>Node.js is an open source, cross-platform runtime environment for developing server-side and networking applications. </p><p>PHP is a popular general-purpose scripting language that is especially suited to web development.</p><p>We use Node.js and Laravel to build web applications and RESTful web services.</p><p>We build eCommerce websites using WordPress and WooCommerce.</p>} =3{<p>React Native is an open-source mobile application framework to develop applications for Android, iOS and Web.</p><p>Electron uses Chromium and Node.js to build cross-platform applications using HTML, CSS, and JavaScript technologies.</p><p> We use Electron to build desktop applications and React Native to build mobile applications.</p>} =4{<p>JavaScript is one of the most popular programming languages in the world.</p><p>JavaScript is everywhere: web, mobile, desktop and server.</p><p>We use React to build web applications and Node.js to build RESTful web services.</p>} =5{<p> We provide dedicated team services to ramp up your development team quickly and efficiently to meet your project deadlines or business needs.</p>} =6{<p> We provide maintenance and support services to keep your website up to date, running smoothly, adding new features, fixing bugs and technical issues.</p>}}",

  "clientText": "<p>We work closely with our clients and partners to deliver the best results possible.</p><p>We believe in long-term partnerships with our clients that bring values to both businesses.</p><p>Here are a few of the many clients that we serve:</p>",

  "careerText": "<p>At Spider, we respect and care for each other.</p><p>Please send your CV to our recruitment team at<strong> contact@spider.vn</strong></p>",

  "careerHeader": "{order, selectordinal, one {Frontend Internship} two {Frontend Developer} =3 {Backend Developer}}",
  "careerDesc": "{order, selectordinal, one {<p>We are looking for someone who is motivated, innovative, enthusiastic, hard-working, interested in web technologies and willing to learn.</p><p>Duration of the internship: 2 to 4 months</p><h4>Must have:</h4><ul><li>Knowledge of HTML, CSS, JavaScript, Bootstrap</li><li>Major in IT, Computer Science or relevant experience</li><li>Desire to learn and research</li><li>Ability to communicate in English</li></ul><h4>Nice to have:</h4><ul><li>Knowledge of jQuery, React, Node.js</li><li>Knowledge of ES, Babel, Webpack, Yarn, NPM</li><li>Passion for Frontend development</li></ul><h4>Benefits:</h4><ul><li>Monthly internship allowance.</li><li>After the completion of training, trainee will become official employee.</li></ul>} =2 {<h4>Job Description</h4><ul><li><p> Practical experience in web development using HTML, CSS and JavaScript</p></li><li><p> Knowledge of JavaScript scope, closure, browser events and cross-browser issues</p></li><li><p>Experience of building websites using best practice techniques such as mobile first, responsive web design and progressive enhancement</p></li><li><p> Experience in developing robust and efficient code for large scale production applications</p></li><li><p> Experience in working with Bootstrap, jQuery and JS frameworks such as Angular, React, React Native</p></li><li><p>Experience in working with Node.js</p></li><li><p>Have knowledge about RESTful API and GraphQL</p></li><li><p>Ability to work on a team, set priorities, work under pressure,adapt to demanding situations, and maintain schedules</p></li><li><p>Proficient understanding of code versioning tools, such as Git</p></li></ul>} =3 {<h4>Job Description</h4><ul><li><p> Proven software development experience in PHP.</p></li><li><p>Solid knowledge of object-oriented programming</p></li><li><p>Integration of static templates developed by Frontend developers</p></li><li><p>Build efficient, testable, and reusable PHP modules</p></li><li><p>Follow industry best practices</p></li><li><p> Troubleshoot to solve architectural challenges and performance problems</p></li><li><p>Practical experience in development of WordPress, Laravel</p></li><li><p>Experience in working experience with Node.js, Hapi</p></li><li><p>Experience in working with MongoDB, MySQL</p></li><li><p>Have knowledge about RESTful API, GraphQL</p></li><li><p>Experience in using Composer for dependency management</p></li><li><p> Experience in developing robust and efficient code for large scale production applications</p></li><li><p>Ability to work on a team, set priorities, work under pressure, adapt to demanding situations, and maintain schedules</p></li><li><p>Ability to work on a team, set priorities, work under pressure, adapt to demanding situations, and maintain schedules.</p></li><li><p>Familiar with CI/CD build and deployment processes</p></li></ul>}}",

  "contactText": "<p>Please do not hesitate to contact us at any time if you have anyfurther questions or concerns and we are always ready to assist you.</p><p>We would love to work with you on your next projects.</p><p>Contact us today to discuss your next projects by filling out the enquiry form below or just drop us a line at <strong>contact@spider.vn</strong>.</p>  ",
  "contactHeaderInfo": "Contact Information",
  "contactHeaderSkill": "Project Information",
  "projectType": "{order, selectordinal, one {Select Type} two{StacticWeb} =3{Corporate Website} =4{Web Application} =5{Desktop Application} =6{Mobile Application} =7{Dedicated Team} =8{Maintenance}}",

  "selectBudget": "{order, selectordinal, one {Select Budget} =2{Less than $1,000} =3{$1,000 - $3,000} =4{ $3,000 - $5,000} =5{$5,000 - $10,000} =6{More than $10,000} =7{Undetermined}}",

  "footerText": "<p>Copyright © 2015 - 2020<strong> Spider Company Limited</strong> All rights reserved</p>"
}
